MESSAGE = """
Привет! 
Данный бот позволяет смотреть расписание на день и неделю
Выберите одну из опций:
"""


MESSAGE_GROUP = """
Введите название группы с большими буквами и без пробелов
Пример: 21-ИСП(9)-0
"""


BUTTON_DAY_TEXT = "Расписание на День"


BUTTON_WEEK_TEXT = "Расписание на Неделю"


SCHEDULE_TABLE = {
    1: "(Начало- 9:00 | Конец - 10:00)",
    2: "(Начало- 9:00 | Конец - 10:00)",
    3: "(Начало- 10:10 | Конец - 11:10)",
    4: "(Начало- 10:10 | Конец - 11:10)",
    5: "(Начало - 11:20 | Конец - 12:20)",
    6: "(Начало - 11:20 | Конец - 12:20)",
    7: "(Начало - 13:00 | Конец - 14:00)",
    8: "(Начало - 13:00 | Конец - 14:00)",
    9: "(Начало - 14:10 | Конец - 15:10)",
    10: "(Начало - 14:10 | Конец - 15:10)",
    11: "(Начало - 15:20 | Конец - 16:20)",
    12: "(Начало - 15:20 | Конец - 16:20)",
    13: "(Начало - 16:30 | Конец - 17:30)",
    14: "(Начало - 16:30 | Конец - 17:30)",
    15: "(Начало - 17:40 | Конец - 18:40)",
    16: "(Начало - 17:40 | Конец - 18:40)",
}


URL = "https://timetable.gstou.ru/User/TimeTablePartial"

PERMANENT_ITEM = 3

COLUMN_COUNT = 20

NUMBER_DAYS_WEEK = 7
